{"format": "layers-model", "generatedBy": "keras v2.16.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.16.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 338], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "actor_dense1", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.4142135623730951, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "actor_dense1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "actor_dense2", "trainable": true, "dtype": "float32", "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.4142135623730951, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "actor_dense2", "inbound_nodes": [[["actor_dense1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "critic_dense1", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.4142135623730951, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "critic_dense1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "actor_mean", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 0.01, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "actor_mean", "inbound_nodes": [[["actor_dense2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "critic_dense2", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.4142135623730951, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "critic_dense2", "inbound_nodes": [[["critic_dense1", 0, 0, {}]]]}, {"class_name": "LogStdLayer", "config": {"name": "log_std", "trainable": true, "dtype": "float32", "action_dim": 21}, "name": "log_std", "inbound_nodes": [[["actor_mean", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "critic_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "critic_output", "inbound_nodes": [[["critic_dense2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["actor_mean", 0, 0], ["log_std", 0, 0], ["critic_output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "actor_dense1/kernel", "shape": [338, 256], "dtype": "float32"}, {"name": "actor_dense1/bias", "shape": [256], "dtype": "float32"}, {"name": "actor_dense2/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "actor_dense2/bias", "shape": [128], "dtype": "float32"}, {"name": "actor_mean/kernel", "shape": [128, 21], "dtype": "float32"}, {"name": "actor_mean/bias", "shape": [21], "dtype": "float32"}, {"name": "critic_dense1/kernel", "shape": [338, 256], "dtype": "float32"}, {"name": "critic_dense1/bias", "shape": [256], "dtype": "float32"}, {"name": "critic_dense2/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "critic_dense2/bias", "shape": [256], "dtype": "float32"}, {"name": "critic_output/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "critic_output/bias", "shape": [1], "dtype": "float32"}, {"name": "log_std/log_std", "shape": [21], "dtype": "float32"}]}]}